//=============================================================================
//
// モデル処理 [enemySpher.h]
// Author : KAZUKI KURA
//
//=============================================================================
#pragma once

#include "main.h"

#include "enemy.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************


// クラスの前方宣言
//class CCamera;
//class CAssimpMesh;
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEnemySpher:public CEnemy
{
private:
	
protected:

public:
	HRESULT InitEnemy(void);
	void UninitEnemy(void);
	void UpdateEnemy(void);
	void DrawEnemy(void);
	
};
