//=============================================================================
//
// ライフ表示処理 [life.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_LIFE			(30)							// 表示桁数
class CLife{
private:
	
	 int							m_nLife;

public:
	HRESULT InitLife(void);
	void UninitLife(void);
	void UpdateLife(void);
	void DrawLife(void);

	void DelLife(int nValue);
	int GetLife(void);

	CLife() { m_nLife = MAX_LIFE; }
	CLife(int nLife) { m_nLife = nLife; };
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
