//=============================================================================
//
// 数値表示処理 [number.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUMBER_SIZE_X		35.0f	// ポリゴンのサイズ
#define NUMBER_SIZE_Y		50.0f	// ポリゴンのサイズ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitNumber();	// 初期化
void UninitNumber();	// 終了処理
void DrawNumber(		// 描画
	XMFLOAT2* pPos,					// 表示位置(左上)
	unsigned uNumber,				// 表示数値
	int nWidth,						// 表示桁数
	float fSizeX = NUMBER_SIZE_X,	// 1文字の幅
	float fSizeY = NUMBER_SIZE_Y);	// 1文字の高さ
