//=============================================================================
//
// シーン遷移処理 [scene.h]
// Author : RYUSUKE	YAMADA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// 定数
//*****************************************************************************
enum EScene
{
	// ***** シーン追加の場合は下に追記 *****
	SCENE_NONE = 0,				// 未設定(最初は何もない)
	SCENE_TITLE,					// タイトル画面
	SCENE_STAGE_SELECT,	// ステージセレクト
	SCENE_GAME,					// ゲーム画面
	SCENE_RUSH,
	SCENE_GAMEOVER,
	SCENE_GAMECLEAR,


	MAX_SCENE
};

//enum GScene
//{
//	// ***** シーン追加の場合は下に追記 *****
//	SCENE_NONE1 = 0,		// 未設定(最初は何もない)
//	STAGE_1,						// ステージ１
//	STAGE_2,						// ステージ2
//	STAGE_3,						// ステージ3
//
//	MAX_GSCENE
//};

/*
・タイトル
　ゲーム開始 F
　チュートリアル F
　ステージ選択 F
　ムービー F
　
・ゲームシーン
　ラッシュ F
　
・エンドシーン
　ラッシュ後ムービー？ F
　ステージクリア！
　リザルト F
　ステージ選択 F
　タイトルに戻る
　→エンディング画面 F
*/

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScene();
void UninitScene();
void UpdateScene();
void DrawScene();

void SetScene(int nScene);		// シーン切り替え
int GetScene(void);